app/Models/TransaksionalModel.php

SELECT `tb_fcr`.`kd_data`, `tb_fcr`.`nomor` as `nomor`, `tb_fcr_agunan`.`bukti_kepemilikan` as `bukti_kepemilikan`, `tb_fcr_usaha`.`lokasi_kantor` as `lokasi_kantor`
FROM `tb_fcr`
JOIN `tb_fcr_agunan` ON `tb_fcr`.`kd_data` = `tb_fcr_agunan`.`kd_data`
JOIN `tb_fcr_usaha` ON `tb_fcr`.`kd_data` = `tb_fcr_usaha`.`kd_data`
WHERE `tb_fcr`.`kd_data` = 'DATA29022024092351'
---
    public function koordinator($kd_data)
    {
        return $this->db->table('tb_fcr')
            ->select('tb_fcr.kd_data, tb_fcr.nomor as nomor, tb_fcr_agunan.bukti_kepemilikan as bukti_kepemilikan, tb_fcr_usaha.lokasi_kantor as lokasi_kantor')
            ->join('tb_fcr_agunan', 'tb_fcr.kd_data = tb_fcr_agunan.kd_data')
            ->join('tb_fcr_usaha', 'tb_fcr.kd_data = tb_fcr_usaha.kd_data')
            ->where('tb_fcr.kd_data', $kd_data)
            ->get()
            ->getLastRow();

SELECT `tb_fcr`.`kd_data`, `tb_fcr`.`nomor` as `nomor`, `tb_fcr_agunan`.`bukti_kepemilikan` as `bukti_kepemilikan`, `tb_fcr_usaha`.`lokasi_kantor` as `lokasi_kantor`
FROM `tb_fcr`
JOIN `tb_fcr_agunan` ON `tb_fcr`.`kd_data` = `tb_fcr_agunan`.`kd_data`
JOIN `tb_fcr_usaha` ON `tb_fcr`.`kd_data` = `tb_fcr_usaha`.`kd_data`
WHERE `tb_fcr`.`kd_data` = 'DATA29022024092351'
---
    public function FCR($kd_data)
    {
        return $this->db->table('tb_fcr')
            ->select('tb_fcr.kd_data, tb_fcr.nomor as nomor, tb_fcr_agunan.bukti_kepemilikan as bukti_kepemilikan, tb_fcr_usaha.lokasi_kantor as lokasi_kantor')
            ->join('tb_fcr_agunan', 'tb_fcr.kd_data = tb_fcr_agunan.kd_data')
            ->join('tb_fcr_usaha', 'tb_fcr.kd_data = tb_fcr_usaha.kd_data')
            ->where('tb_fcr.kd_data', $kd_data)
            ->get()
            ->getRowArray();